espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 UHCI0 INT MAP REG */
/** Type of uhci0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uhci0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uhci0_int_map:6;
        /** core1_uhci0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uhci0_int_src_pass_in_sec:1;
        /** core1_uhci0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uhci0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uhci0_int_map_reg_t;


/** Group: CORE1 UART0 INT MAP REG */
/** Type of uart0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uart0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uart0_int_map:6;
        /** core1_uart0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uart0_int_src_pass_in_sec:1;
        /** core1_uart0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uart0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uart0_int_map_reg_t;


/** Group: CORE1 UART1 INT MAP REG */
/** Type of uart1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uart1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uart1_int_map:6;
        /** core1_uart1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uart1_int_src_pass_in_sec:1;
        /** core1_uart1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uart1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uart1_int_map_reg_t;


/** Group: CORE1 UART2 INT MAP REG */
/** Type of uart2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uart2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uart2_int_map:6;
        /** core1_uart2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uart2_int_src_pass_in_sec:1;
        /** core1_uart2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uart2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uart2_int_map_reg_t;


/** Group: CORE1 UART3 INT MAP REG */
/** Type of uart3_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uart3_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uart3_int_map:6;
        /** core1_uart3_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uart3_int_src_pass_in_sec:1;
        /** core1_uart3_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uart3_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uart3_int_map_reg_t;


/** Group: CORE1 UART4 INT MAP REG */
/** Type of uart4_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_uart4_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_uart4_int_map:6;
        /** core1_uart4_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_uart4_int_src_pass_in_sec:1;
        /** core1_uart4_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_uart4_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_uart4_int_map_reg_t;


/** Group: CORE1 LCD CAM INT MAP REG */
/** Type of lcd_cam_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_lcd_cam_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_lcd_cam_int_map:6;
        /** core1_lcd_cam_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_lcd_cam_int_src_pass_in_sec:1;
        /** core1_lcd_cam_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_lcd_cam_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_lcd_cam_int_map_reg_t;


/** Group: CORE1 ADC INT MAP REG */
/** Type of adc_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_adc_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_adc_int_map:6;
        /** core1_adc_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_adc_int_src_pass_in_sec:1;
        /** core1_adc_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_adc_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_adc_int_map_reg_t;


/** Group: CORE1 PWM0 INT MAP REG */
/** Type of pwm0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_pwm0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_pwm0_int_map:6;
        /** core1_pwm0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_pwm0_int_src_pass_in_sec:1;
        /** core1_pwm0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_pwm0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_pwm0_int_map_reg_t;


