espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 TIMERGRP1 T1 INT MAP REG */
/** Type of timergrp1_t1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_timergrp1_t1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_timergrp1_t1_int_map:6;
        /** core1_timergrp1_t1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_timergrp1_t1_int_src_pass_in_sec:1;
        /** core1_timergrp1_t1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_timergrp1_t1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_timergrp1_t1_int_map_reg_t;


/** Group: CORE1 TIMERGRP1 WDT INT MAP REG */
/** Type of timergrp1_wdt_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_timergrp1_wdt_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_timergrp1_wdt_int_map:6;
        /** core1_timergrp1_wdt_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_timergrp1_wdt_int_src_pass_in_sec:1;
        /** core1_timergrp1_wdt_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_timergrp1_wdt_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_timergrp1_wdt_int_map_reg_t;


/** Group: CORE1 LEDC INT MAP REG */
/** Type of ledc_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ledc_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ledc_int_map:6;
        /** core1_ledc_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ledc_int_src_pass_in_sec:1;
        /** core1_ledc_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ledc_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ledc_int_map_reg_t;


/** Group: CORE1 SYSTIMER TARGET0 INT MAP REG */
/** Type of systimer_target0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_systimer_target0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_systimer_target0_int_map:6;
        /** core1_systimer_target0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target0_int_src_pass_in_sec:1;
        /** core1_systimer_target0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_systimer_target0_int_map_reg_t;


/** Group: CORE1 SYSTIMER TARGET1 INT MAP REG */
/** Type of systimer_target1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_systimer_target1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_systimer_target1_int_map:6;
        /** core1_systimer_target1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target1_int_src_pass_in_sec:1;
        /** core1_systimer_target1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_systimer_target1_int_map_reg_t;


/** Group: CORE1 SYSTIMER TARGET2 INT MAP REG */
/** Type of systimer_target2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_systimer_target2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_systimer_target2_int_map:6;
        /** core1_systimer_target2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target2_int_src_pass_in_sec:1;
        /** core1_systimer_target2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_systimer_target2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_systimer_target2_int_map_reg_t;


/** Group: CORE1 AHB PDMA IN CH0 INT MAP REG */
/** Type of ahb_pdma_in_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_in_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_in_ch0_int_map:6;
        /** core1_ahb_pdma_in_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch0_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_in_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_in_ch0_int_map_reg_t;


/** Group: CORE1 AHB PDMA IN CH1 INT MAP REG */
/** Type of ahb_pdma_in_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_in_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_in_ch1_int_map:6;
        /** core1_ahb_pdma_in_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch1_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_in_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_in_ch1_int_map_reg_t;


