espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 AHB PDMA IN CH2 INT MAP REG */
/** Type of ahb_pdma_in_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_in_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_in_ch2_int_map:6;
        /** core1_ahb_pdma_in_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch2_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_in_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_in_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_in_ch2_int_map_reg_t;


/** Group: CORE1 AHB PDMA OUT CH0 INT MAP REG */
/** Type of ahb_pdma_out_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_out_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_out_ch0_int_map:6;
        /** core1_ahb_pdma_out_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch0_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_out_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_out_ch0_int_map_reg_t;


/** Group: CORE1 AHB PDMA OUT CH1 INT MAP REG */
/** Type of ahb_pdma_out_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_out_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_out_ch1_int_map:6;
        /** core1_ahb_pdma_out_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch1_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_out_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_out_ch1_int_map_reg_t;


/** Group: CORE1 AHB PDMA OUT CH2 INT MAP REG */
/** Type of ahb_pdma_out_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ahb_pdma_out_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ahb_pdma_out_ch2_int_map:6;
        /** core1_ahb_pdma_out_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch2_int_src_pass_in_sec:1;
        /** core1_ahb_pdma_out_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ahb_pdma_out_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ahb_pdma_out_ch2_int_map_reg_t;


/** Group: CORE1 AXI PDMA IN CH0 INT MAP REG */
/** Type of axi_pdma_in_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_in_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_in_ch0_int_map:6;
        /** core1_axi_pdma_in_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch0_int_src_pass_in_sec:1;
        /** core1_axi_pdma_in_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_in_ch0_int_map_reg_t;


/** Group: CORE1 AXI PDMA IN CH1 INT MAP REG */
/** Type of axi_pdma_in_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_in_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_in_ch1_int_map:6;
        /** core1_axi_pdma_in_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch1_int_src_pass_in_sec:1;
        /** core1_axi_pdma_in_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_in_ch1_int_map_reg_t;


/** Group: CORE1 AXI PDMA IN CH2 INT MAP REG */
/** Type of axi_pdma_in_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_in_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_in_ch2_int_map:6;
        /** core1_axi_pdma_in_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch2_int_src_pass_in_sec:1;
        /** core1_axi_pdma_in_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_in_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_in_ch2_int_map_reg_t;


/** Group: CORE1 AXI PDMA OUT CH0 INT MAP REG */
/** Type of axi_pdma_out_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_out_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_out_ch0_int_map:6;
        /** core1_axi_pdma_out_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch0_int_src_pass_in_sec:1;
        /** core1_axi_pdma_out_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_out_ch0_int_map_reg_t;


/** Group: CORE1 AXI PDMA OUT CH1 INT MAP REG */
/** Type of axi_pdma_out_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_out_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_out_ch1_int_map:6;
        /** core1_axi_pdma_out_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch1_int_src_pass_in_sec:1;
        /** core1_axi_pdma_out_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_out_ch1_int_map_reg_t;


/** Group: CORE1 AXI PDMA OUT CH2 INT MAP REG */
/** Type of axi_pdma_out_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_pdma_out_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_pdma_out_ch2_int_map:6;
        /** core1_axi_pdma_out_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch2_int_src_pass_in_sec:1;
        /** core1_axi_pdma_out_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_pdma_out_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_pdma_out_ch2_int_map_reg_t;


