espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 RSA INT MAP REG */
/** Type of rsa_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_rsa_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_rsa_int_map:6;
        /** core1_rsa_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_rsa_int_src_pass_in_sec:1;
        /** core1_rsa_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_rsa_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_rsa_int_map_reg_t;


/** Group: CORE1 AES INT MAP REG */
/** Type of aes_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_aes_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_aes_int_map:6;
        /** core1_aes_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_aes_int_src_pass_in_sec:1;
        /** core1_aes_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_aes_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_aes_int_map_reg_t;


/** Group: CORE1 SHA INT MAP REG */
/** Type of sha_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_sha_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_sha_int_map:6;
        /** core1_sha_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_sha_int_src_pass_in_sec:1;
        /** core1_sha_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_sha_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_sha_int_map_reg_t;


/** Group: CORE1 ECC INT MAP REG */
/** Type of ecc_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ecc_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ecc_int_map:6;
        /** core1_ecc_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ecc_int_src_pass_in_sec:1;
        /** core1_ecc_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ecc_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ecc_int_map_reg_t;


/** Group: CORE1 ECDSA INT MAP REG */
/** Type of ecdsa_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_ecdsa_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_ecdsa_int_map:6;
        /** core1_ecdsa_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_ecdsa_int_src_pass_in_sec:1;
        /** core1_ecdsa_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_ecdsa_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_ecdsa_int_map_reg_t;


/** Group: CORE1 KM INT MAP REG */
/** Type of km_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_km_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_km_int_map:6;
        /** core1_km_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_km_int_src_pass_in_sec:1;
        /** core1_km_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_km_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_km_int_map_reg_t;


/** Group: CORE1 GPIO INT0 MAP REG */
/** Type of gpio_int0_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_gpio_int0_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_gpio_int0_map:6;
        /** core1_gpio_int0_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int0_src_pass_in_sec:1;
        /** core1_gpio_int0_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int0_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_gpio_int0_map_reg_t;


/** Group: CORE1 GPIO INT1 MAP REG */
/** Type of gpio_int1_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_gpio_int1_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_gpio_int1_map:6;
        /** core1_gpio_int1_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int1_src_pass_in_sec:1;
        /** core1_gpio_int1_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int1_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_gpio_int1_map_reg_t;


/** Group: CORE1 GPIO INT2 MAP REG */
/** Type of gpio_int2_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_gpio_int2_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_gpio_int2_map:6;
        /** core1_gpio_int2_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int2_src_pass_in_sec:1;
        /** core1_gpio_int2_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_gpio_int2_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_gpio_int2_map_reg_t;


