espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 HP PAU INT MAP REG */
/** Type of hp_pau_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_hp_pau_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_hp_pau_int_map:6;
        /** core1_hp_pau_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_hp_pau_int_src_pass_in_sec:1;
        /** core1_hp_pau_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_hp_pau_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_hp_pau_int_map_reg_t;


/** Group: CORE1 HP PARLIO RX INT MAP REG */
/** Type of hp_parlio_rx_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_hp_parlio_rx_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_hp_parlio_rx_int_map:6;
        /** core1_hp_parlio_rx_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_hp_parlio_rx_int_src_pass_in_sec:1;
        /** core1_hp_parlio_rx_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_hp_parlio_rx_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_hp_parlio_rx_int_map_reg_t;


/** Group: CORE1 HP PARLIO TX INT MAP REG */
/** Type of hp_parlio_tx_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_hp_parlio_tx_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_hp_parlio_tx_int_map:6;
        /** core1_hp_parlio_tx_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_hp_parlio_tx_int_src_pass_in_sec:1;
        /** core1_hp_parlio_tx_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_hp_parlio_tx_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_hp_parlio_tx_int_map_reg_t;


/** Group: CORE1 H264 DMA2D OUT CH0 INT MAP REG */
/** Type of h264_dma2d_out_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_out_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_out_ch0_int_map:6;
        /** core1_h264_dma2d_out_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch0_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_out_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_out_ch0_int_map_reg_t;


/** Group: CORE1 H264 DMA2D OUT CH1 INT MAP REG */
/** Type of h264_dma2d_out_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_out_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_out_ch1_int_map:6;
        /** core1_h264_dma2d_out_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch1_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_out_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_out_ch1_int_map_reg_t;


/** Group: CORE1 H264 DMA2D OUT CH2 INT MAP REG */
/** Type of h264_dma2d_out_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_out_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_out_ch2_int_map:6;
        /** core1_h264_dma2d_out_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch2_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_out_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_out_ch2_int_map_reg_t;


/** Group: CORE1 H264 DMA2D OUT CH3 INT MAP REG */
/** Type of h264_dma2d_out_ch3_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_out_ch3_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_out_ch3_int_map:6;
        /** core1_h264_dma2d_out_ch3_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch3_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_out_ch3_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch3_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_out_ch3_int_map_reg_t;


/** Group: CORE1 H264 DMA2D OUT CH4 INT MAP REG */
/** Type of h264_dma2d_out_ch4_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_out_ch4_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_out_ch4_int_map:6;
        /** core1_h264_dma2d_out_ch4_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch4_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_out_ch4_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_out_ch4_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_out_ch4_int_map_reg_t;


/** Group: CORE1 H264 DMA2D IN CH0 INT MAP REG */
/** Type of h264_dma2d_in_ch0_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch0_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch0_int_map:6;
        /** core1_h264_dma2d_in_ch0_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch0_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch0_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch0_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch0_int_map_reg_t;


/** Group: CORE1 H264 DMA2D IN CH1 INT MAP REG */
/** Type of h264_dma2d_in_ch1_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch1_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch1_int_map:6;
        /** core1_h264_dma2d_in_ch1_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch1_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch1_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch1_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch1_int_map_reg_t;


