espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 H264 DMA2D IN CH2 INT MAP REG */
/** Type of h264_dma2d_in_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch2_int_map:6;
        /** core1_h264_dma2d_in_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch2_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch2_int_map_reg_t;


/** Group: CORE1 H264 DMA2D IN CH3 INT MAP REG */
/** Type of h264_dma2d_in_ch3_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch3_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch3_int_map:6;
        /** core1_h264_dma2d_in_ch3_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch3_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch3_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch3_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch3_int_map_reg_t;


/** Group: CORE1 H264 DMA2D IN CH4 INT MAP REG */
/** Type of h264_dma2d_in_ch4_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch4_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch4_int_map:6;
        /** core1_h264_dma2d_in_ch4_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch4_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch4_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch4_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch4_int_map_reg_t;


/** Group: CORE1 H264 DMA2D IN CH5 INT MAP REG */
/** Type of h264_dma2d_in_ch5_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_dma2d_in_ch5_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_dma2d_in_ch5_int_map:6;
        /** core1_h264_dma2d_in_ch5_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch5_int_src_pass_in_sec:1;
        /** core1_h264_dma2d_in_ch5_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_dma2d_in_ch5_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_dma2d_in_ch5_int_map_reg_t;


/** Group: CORE1 H264 REG INT MAP REG */
/** Type of h264_reg_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_h264_reg_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_h264_reg_int_map:6;
        /** core1_h264_reg_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_h264_reg_int_src_pass_in_sec:1;
        /** core1_h264_reg_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_h264_reg_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_h264_reg_int_map_reg_t;


/** Group: CORE1 ASSIST DEBUG INT MAP REG */
/** Type of assist_debug_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_assist_debug_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_assist_debug_int_map:6;
        /** core1_assist_debug_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_assist_debug_int_src_pass_in_sec:1;
        /** core1_assist_debug_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_assist_debug_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_assist_debug_int_map_reg_t;


/** Group: CORE1 INTR STATUS REG 0 REG */
/** Type of intr_status_reg_0 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_status_0 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_status_0:32;
    };
    uint32_t val;
} core1_intr_status_reg_0_reg_t;


/** Group: CORE1 INTR STATUS REG 1 REG */
/** Type of intr_status_reg_1 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_status_1 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_status_1:32;
    };
    uint32_t val;
} core1_intr_status_reg_1_reg_t;


/** Group: CORE1 INTR STATUS REG 2 REG */
/** Type of intr_status_reg_2 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_status_2 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_status_2:32;
    };
    uint32_t val;
} core1_intr_status_reg_2_reg_t;


/** Group: CORE1 INTR STATUS REG 3 REG */
/** Type of intr_status_reg_3 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_status_3 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_status_3:32;
    };
    uint32_t val;
} core1_intr_status_reg_3_reg_t;


/** Group: CORE1 CLOCK GATE REG */
/** Type of clock_gate register
 *  NA
 */
typedef union {
    struct {
        /** core1_reg_clk_en : R/W; bitpos: [0]; default: 1;
         *  NA
         */
        uint32_t core1_reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} core1_clock_gate_reg_t;


/** Group: CORE1 DMA2D IN CH2 INT MAP REG */
/** Type of dma2d_in_ch2_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_dma2d_in_ch2_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_dma2d_in_ch2_int_map:6;
        /** core1_dma2d_in_ch2_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_dma2d_in_ch2_int_src_pass_in_sec:1;
        /** core1_dma2d_in_ch2_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_dma2d_in_ch2_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_dma2d_in_ch2_int_map_reg_t;


/** Group: CORE1 DMA2D OUT CH3 INT MAP REG */
/** Type of dma2d_out_ch3_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_dma2d_out_ch3_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_dma2d_out_ch3_int_map:6;
        /** core1_dma2d_out_ch3_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_dma2d_out_ch3_int_src_pass_in_sec:1;
        /** core1_dma2d_out_ch3_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_dma2d_out_ch3_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_dma2d_out_ch3_int_map_reg_t;


/** Group: CORE1 AXI PERF MON INT MAP REG */
/** Type of axi_perf_mon_int_map register
 *  NA
 */
typedef union {
    struct {
        /** core1_axi_perf_mon_int_map : R/W; bitpos: [5:0]; default: 0;
         *  Configures the interrupt source into one CPU interrupt.
         */
        uint32_t core1_axi_perf_mon_int_map:6;
        /** core1_axi_perf_mon_int_src_pass_in_sec : R/W; bitpos: [6]; default: 0;
         *  NA
         */
        uint32_t core1_axi_perf_mon_int_src_pass_in_sec:1;
        /** core1_axi_perf_mon_int_src_in_sec_flag : R/W; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t core1_axi_perf_mon_int_src_in_sec_flag:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} core1_axi_perf_mon_int_map_reg_t;


/** Group: CORE1 INTR STATUS REG 4 REG */
/** Type of intr_status_reg_4 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_status_4 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_status_4:32;
    };
    uint32_t val;
} core1_intr_status_reg_4_reg_t;


