espressif/esp-idf/components/soc/esp32p4/register/hw_ver2/soc/interrupt_core1_struct.h
/** Group: CORE1 INTR SIG IDX ASSERT IN SEC REG */
/** Type of intr_sig_idx_assert_in_sec register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_sig_idx_assert_in_sec : R/W; bitpos: [5:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_sig_idx_assert_in_sec:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} core1_intr_sig_idx_assert_in_sec_reg_t;


/** Group: CORE1 INTR SEC STATUS REG */
/** Type of intr_sec_status register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_sec_status : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_sec_status:32;
    };
    uint32_t val;
} core1_intr_sec_status_reg_t;


/** Group: CORE1 INTR SRC PASS IN SEC STATUS 0 REG */
/** Type of intr_src_pass_in_sec_status_0 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_src_pass_in_sec_status_0 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_src_pass_in_sec_status_0:32;
    };
    uint32_t val;
} core1_intr_src_pass_in_sec_status_0_reg_t;


/** Group: CORE1 INTR SRC PASS IN SEC STATUS 1 REG */
/** Type of intr_src_pass_in_sec_status_1 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_src_pass_in_sec_status_1 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_src_pass_in_sec_status_1:32;
    };
    uint32_t val;
} core1_intr_src_pass_in_sec_status_1_reg_t;


/** Group: CORE1 INTR SRC PASS IN SEC STATUS 2 REG */
/** Type of intr_src_pass_in_sec_status_2 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_src_pass_in_sec_status_2 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_src_pass_in_sec_status_2:32;
    };
    uint32_t val;
} core1_intr_src_pass_in_sec_status_2_reg_t;


/** Group: CORE1 INTR SRC PASS IN SEC STATUS 3 REG */
/** Type of intr_src_pass_in_sec_status_3 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_src_pass_in_sec_status_3 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_src_pass_in_sec_status_3:32;
    };
    uint32_t val;
} core1_intr_src_pass_in_sec_status_3_reg_t;


/** Group: CORE1 INTR SRC PASS IN SEC STATUS 4 REG */
/** Type of intr_src_pass_in_sec_status_4 register
 *  NA
 */
typedef union {
    struct {
        /** core1_intr_src_pass_in_sec_status_4 : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t core1_intr_src_pass_in_sec_status_4:32;
    };
    uint32_t val;
} core1_intr_src_pass_in_sec_status_4_reg_t;


/** Group: CORE1 INTERRUPT REG DATE REG */
/** Type of interrupt_reg_date register
 *  NA
 */
typedef union {
    struct {
        /** core1_interrupt_reg_date : R/W; bitpos: [27:0]; default: 38806144;
         *  NA
         */
        uint32_t core1_interrupt_reg_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} core1_interrupt_reg_date_reg_t;


typedef struct {
    volatile core1_lp_rtc_int_map_reg_t lp_rtc_int_map;
    volatile core1_lp_wdt_int_map_reg_t lp_wdt_int_map;
    volatile core1_lp_timer_reg_0_int_map_reg_t lp_timer_reg_0_int_map;
    volatile core1_lp_timer_reg_1_int_map_reg_t lp_timer_reg_1_int_map;
    volatile core1_mb_hp_int_map_reg_t mb_hp_int_map;
    volatile core1_mb_lp_int_map_reg_t mb_lp_int_map;
    volatile core1_pmu_reg_0_int_map_reg_t pmu_reg_0_int_map;
    volatile core1_pmu_reg_1_int_map_reg_t pmu_reg_1_int_map;
    volatile core1_lp_anaperi_int_map_reg_t lp_anaperi_int_map;
    volatile core1_lp_adc_int_map_reg_t lp_adc_int_map;
    volatile core1_lp_gpio_int_map_reg_t lp_gpio_int_map;
    volatile core1_lp_i2c_int_map_reg_t lp_i2c_int_map;
    volatile core1_lp_i2s_int_map_reg_t lp_i2s_int_map;
    volatile core1_lp_spi_int_map_reg_t lp_spi_int_map;
    volatile core1_lp_touch_int_map_reg_t lp_touch_int_map;
    volatile core1_lp_tsens_int_map_reg_t lp_tsens_int_map;
    volatile core1_lp_uart_int_map_reg_t lp_uart_int_map;
    volatile core1_lp_efuse_int_map_reg_t lp_efuse_int_map;
    volatile core1_lp_sw_int_map_reg_t lp_sw_int_map;
    volatile core1_lp_sysreg_int_map_reg_t lp_sysreg_int_map;
    volatile core1_lp_huk_int_map_reg_t lp_huk_int_map;
    volatile core1_sys_icm_int_map_reg_t sys_icm_int_map;
    volatile core1_usb_device_int_map_reg_t usb_device_int_map;
    volatile core1_sdio_host_int_map_reg_t sdio_host_int_map;
    volatile core1_gdma_int_map_reg_t gdma_int_map;
    volatile core1_spi2_int_map_reg_t spi2_int_map;
    volatile core1_spi3_int_map_reg_t spi3_int_map;
    volatile core1_i2s0_int_map_reg_t i2s0_int_map;
    volatile core1_i2s1_int_map_reg_t i2s1_int_map;
    volatile core1_i2s2_int_map_reg_t i2s2_int_map;
    volatile core1_uhci0_int_map_reg_t uhci0_int_map;
    volatile core1_uart0_int_map_reg_t uart0_int_map;
    volatile core1_uart1_int_map_reg_t uart1_int_map;
    volatile core1_uart2_int_map_reg_t uart2_int_map;
    volatile core1_uart3_int_map_reg_t uart3_int_map;
    volatile core1_uart4_int_map_reg_t uart4_int_map;
    volatile core1_lcd_cam_int_map_reg_t lcd_cam_int_map;
    volatile core1_adc_int_map_reg_t adc_int_map;
    volatile core1_pwm0_int_map_reg_t pwm0_int_map;
    volatile core1_pwm1_int_map_reg_t pwm1_int_map;
    volatile core1_can0_int_map_reg_t can0_int_map;
    volatile core1_can1_int_map_reg_t can1_int_map;
    volatile core1_can2_int_map_reg_t can2_int_map;
    volatile core1_rmt_int_map_reg_t rmt_int_map;
    volatile core1_i2c0_int_map_reg_t i2c0_int_map;
    volatile core1_i2c1_int_map_reg_t i2c1_int_map;
    volatile core1_timergrp0_t0_int_map_reg_t timergrp0_t0_int_map;
    volatile core1_timergrp0_t1_int_map_reg_t timergrp0_t1_int_map;
    volatile core1_timergrp0_wdt_int_map_reg_t timergrp0_wdt_int_map;
    volatile core1_timergrp1_t0_int_map_reg_t timergrp1_t0_int_map;
    volatile core1_timergrp1_t1_int_map_reg_t timergrp1_t1_int_map;
    volatile core1_timergrp1_wdt_int_map_reg_t timergrp1_wdt_int_map;
    volatile core1_ledc_int_map_reg_t ledc_int_map;
    volatile core1_systimer_target0_int_map_reg_t systimer_target0_int_map;
    volatile core1_systimer_target1_int_map_reg_t systimer_target1_int_map;
    volatile core1_systimer_target2_int_map_reg_t systimer_target2_int_map;
    volatile core1_ahb_pdma_in_ch0_int_map_reg_t ahb_pdma_in_ch0_int_map;
    volatile core1_ahb_pdma_in_ch1_int_map_reg_t ahb_pdma_in_ch1_int_map;
    volatile core1_ahb_pdma_in_ch2_int_map_reg_t ahb_pdma_in_ch2_int_map;
    volatile core1_ahb_pdma_out_ch0_int_map_reg_t ahb_pdma_out_ch0_int_map;
    volatile core1_ahb_pdma_out_ch1_int_map_reg_t ahb_pdma_out_ch1_int_map;
    volatile core1_ahb_pdma_out_ch2_int_map_reg_t ahb_pdma_out_ch2_int_map;
    volatile core1_axi_pdma_in_ch0_int_map_reg_t axi_pdma_in_ch0_int_map;
    volatile core1_axi_pdma_in_ch1_int_map_reg_t axi_pdma_in_ch1_int_map;
    volatile core1_axi_pdma_in_ch2_int_map_reg_t axi_pdma_in_ch2_int_map;
    volatile core1_axi_pdma_out_ch0_int_map_reg_t axi_pdma_out_ch0_int_map;
    volatile core1_axi_pdma_out_ch1_int_map_reg_t axi_pdma_out_ch1_int_map;
    volatile core1_axi_pdma_out_ch2_int_map_reg_t axi_pdma_out_ch2_int_map;
    volatile core1_rsa_int_map_reg_t rsa_int_map;
    volatile core1_aes_int_map_reg_t aes_int_map;
    volatile core1_sha_int_map_reg_t sha_int_map;
    volatile core1_ecc_int_map_reg_t ecc_int_map;
    volatile core1_ecdsa_int_map_reg_t ecdsa_int_map;
    volatile core1_km_int_map_reg_t km_int_map;
    volatile core1_gpio_int0_map_reg_t gpio_int0_map;
    volatile core1_gpio_int1_map_reg_t gpio_int1_map;
    volatile core1_gpio_int2_map_reg_t gpio_int2_map;
    volatile core1_gpio_int3_map_reg_t gpio_int3_map;
    volatile core1_gpio_pad_comp_int_map_reg_t gpio_pad_comp_int_map;
    volatile core1_cpu_int_from_cpu_0_map_reg_t cpu_int_from_cpu_0_map;
    volatile core1_cpu_int_from_cpu_1_map_reg_t cpu_int_from_cpu_1_map;
    volatile core1_cpu_int_from_cpu_2_map_reg_t cpu_int_from_cpu_2_map;
    volatile core1_cpu_int_from_cpu_3_map_reg_t cpu_int_from_cpu_3_map;
    volatile core1_cache_int_map_reg_t cache_int_map;
    volatile core1_flash_mspi_int_map_reg_t flash_mspi_int_map;
    volatile core1_csi_bridge_int_map_reg_t csi_bridge_int_map;
    volatile core1_dsi_bridge_int_map_reg_t dsi_bridge_int_map;
    volatile core1_csi_int_map_reg_t csi_int_map;
    volatile core1_dsi_int_map_reg_t dsi_int_map;
    volatile core1_gmii_phy_int_map_reg_t gmii_phy_int_map;
    volatile core1_lpi_int_map_reg_t lpi_int_map;
    volatile core1_pmt_int_map_reg_t pmt_int_map;
    volatile core1_sbd_int_map_reg_t sbd_int_map;
    volatile core1_usb_otg_int_map_reg_t usb_otg_int_map;
    volatile core1_usb_otg_endp_multi_proc_int_map_reg_t usb_otg_endp_multi_proc_int_map;
    volatile core1_jpeg_int_map_reg_t jpeg_int_map;
    volatile core1_ppa_int_map_reg_t ppa_int_map;
    volatile core1_core0_trace_int_map_reg_t core0_trace_int_map;
    volatile core1_core1_trace_int_map_reg_t core1_trace_int_map;
    volatile core1_hp_core_ctrl_int_map_reg_t hp_core_ctrl_int_map;
    volatile core1_isp_int_map_reg_t isp_int_map;
    volatile core1_i3c_mst_int_map_reg_t i3c_mst_int_map;
    volatile core1_i3c_slv_int_map_reg_t i3c_slv_int_map;
    volatile core1_usb_otg11_int_map_reg_t usb_otg11_int_map;
    volatile core1_dma2d_in_ch0_int_map_reg_t dma2d_in_ch0_int_map;
    volatile core1_dma2d_in_ch1_int_map_reg_t dma2d_in_ch1_int_map;
    volatile core1_dma2d_out_ch0_int_map_reg_t dma2d_out_ch0_int_map;
    volatile core1_dma2d_out_ch1_int_map_reg_t dma2d_out_ch1_int_map;
    volatile core1_dma2d_out_ch2_int_map_reg_t dma2d_out_ch2_int_map;
    volatile core1_psram_mspi_int_map_reg_t psram_mspi_int_map;
    volatile core1_hp_sysreg_int_map_reg_t hp_sysreg_int_map;
    volatile core1_pcnt_int_map_reg_t pcnt_int_map;
    volatile core1_hp_pau_int_map_reg_t hp_pau_int_map;
    volatile core1_hp_parlio_rx_int_map_reg_t hp_parlio_rx_int_map;
    volatile core1_hp_parlio_tx_int_map_reg_t hp_parlio_tx_int_map;
    volatile core1_h264_dma2d_out_ch0_int_map_reg_t h264_dma2d_out_ch0_int_map;
    volatile core1_h264_dma2d_out_ch1_int_map_reg_t h264_dma2d_out_ch1_int_map;
    volatile core1_h264_dma2d_out_ch2_int_map_reg_t h264_dma2d_out_ch2_int_map;
    volatile core1_h264_dma2d_out_ch3_int_map_reg_t h264_dma2d_out_ch3_int_map;
    volatile core1_h264_dma2d_out_ch4_int_map_reg_t h264_dma2d_out_ch4_int_map;
    volatile core1_h264_dma2d_in_ch0_int_map_reg_t h264_dma2d_in_ch0_int_map;
    volatile core1_h264_dma2d_in_ch1_int_map_reg_t h264_dma2d_in_ch1_int_map;
    volatile core1_h264_dma2d_in_ch2_int_map_reg_t h264_dma2d_in_ch2_int_map;
    volatile core1_h264_dma2d_in_ch3_int_map_reg_t h264_dma2d_in_ch3_int_map;
    volatile core1_h264_dma2d_in_ch4_int_map_reg_t h264_dma2d_in_ch4_int_map;
    volatile core1_h264_dma2d_in_ch5_int_map_reg_t h264_dma2d_in_ch5_int_map;
    volatile core1_h264_reg_int_map_reg_t h264_reg_int_map;
    volatile core1_assist_debug_int_map_reg_t assist_debug_int_map;
    volatile core1_intr_status_reg_0_reg_t intr_status_reg_0;
    volatile core1_intr_status_reg_1_reg_t intr_status_reg_1;
    volatile core1_intr_status_reg_2_reg_t intr_status_reg_2;
    volatile core1_intr_status_reg_3_reg_t intr_status_reg_3;
    volatile core1_clock_gate_reg_t clock_gate;
    volatile core1_dma2d_in_ch2_int_map_reg_t dma2d_in_ch2_int_map;
    volatile core1_dma2d_out_ch3_int_map_reg_t dma2d_out_ch3_int_map;
    volatile core1_axi_perf_mon_int_map_reg_t axi_perf_mon_int_map;
    volatile core1_intr_status_reg_4_reg_t intr_status_reg_4;
    uint32_t reserved_224;
    volatile core1_intr_sig_idx_assert_in_sec_reg_t intr_sig_idx_assert_in_sec;
    volatile core1_intr_sec_status_reg_t intr_sec_status;
    volatile core1_intr_src_pass_in_sec_status_0_reg_t intr_src_pass_in_sec_status_0;
    volatile core1_intr_src_pass_in_sec_status_1_reg_t intr_src_pass_in_sec_status_1;
    volatile core1_intr_src_pass_in_sec_status_2_reg_t intr_src_pass_in_sec_status_2;
    volatile core1_intr_src_pass_in_sec_status_3_reg_t intr_src_pass_in_sec_status_3;
    volatile core1_intr_src_pass_in_sec_status_4_reg_t intr_src_pass_in_sec_status_4;
    uint32_t reserved_244[110];
    volatile core1_interrupt_reg_date_reg_t interrupt_reg_date;
} core1_dev_t;

extern core1_dev_t INTR_CORE0;

#ifndef __cplusplus
_Static_assert(sizeof(core1_dev_t) == 0x400, "Invalid size of core1_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
